[
  {
    "dua": {
      "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina adhaban-nar",
      "translation": {
        "en": "Our Lord, give us in this world good and in the Hereafter good, and protect us from the punishment of the Fire.",
        "ur": "اے ہمارے رب! ہمیں دنیا میں بھلائی دے اور آخرت میں بھی بھلائی عطا فرما اور ہمیں آگ کے عذاب سے بچا",
        "ps": "زموږ رب! موږ ته په دنیا کې ښېګړتیا راکړه او په آخرت کې هم ښېګړتیا راکړه او موږ د اور له عذاب څخه وساته"
      },
      "reference": "Quran 2:201"
    },
    "category": "General",
    "usage": "Daily supplication for worldly and spiritual well-being"
  },
  {
    "dua": {
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ",
      "transliteration": "Allahumma inni as'aluka al-'afwa wal-'afiyah fid-dunya wal-akhirah",
      "translation": {
        "en": "O Allah, I ask You for forgiveness and well-being in this world and the Hereafter.",
        "ur": "اے اللہ! میں تجھ سے دنیا اور آخرت میں معافی اور عافیت مانگتا ہوں",
        "ps": "الله زما خدایه! زه له تا څخه په دنیا او آخرت کې بخښنه او عافیت غواړم"
      },
      "reference": "Sunan Abi Dawud 5074"
    },
    "category": "Morning & Evening",
    "usage": "Daily protection and well-being"
  },
  {
    "dua": {
      "arabic": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي",
      "transliteration": "Rabbi ishrah li sadri wa yassir li amri",
      "translation": {
        "en": "My Lord, expand for me my breast and ease for me my task.",
        "ur": "اے میرے رب! میرے سینے کو کشادہ کر دے اور میرے کام کو آسان بنا دے",
        "ps": "زما رب! زما سینه پراخه کړه او زما کار اسانه کړه"
      },
      "reference": "Quran 20:25-26"
    },
    "category": "Difficulties",
    "usage": "When facing challenges or starting a difficult task"
  },
  {
    "dua": {
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ",
      "transliteration": "Allahumma inni a'udhu bika minal-hammi wal-hazan",
      "translation": {
        "en": "O Allah, I seek refuge in You from worry and grief.",
        "ur": "اے اللہ! میں فکر اور غم سے تیری پناہ مانگتا ہوں",
        "ps": "الله زما خدایه! زه له تا څخه د فکر او غم څخه پناه غواړم"
      },
      "reference": "Sahih Bukhari 7:70:559"
    },
    "category": "Relief",
    "usage": "For anxiety, worry and sadness"
  },
  {
    "dua": {
      "arabic": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
      "transliteration": "Hasbunallahu wa ni'mal-wakeel",
      "translation": {
        "en": "Sufficient for us is Allah, and He is the best Disposer of affairs.",
        "ur": "اللہ ہمارے لیے کافی ہے اور وہ بہترین کارساز ہے",
        "ps": "الله زموږ لپاره کافي دی او هغه غوره کارساز دی"
      },
      "reference": "Quran 3:173"
    },
    "category": "Trust",
    "usage": "For placing trust in Allah during hardship"
  },
  {
    "dua": {
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلًا مُتَقَبَّلًا",
      "transliteration": "Allahumma inni as'aluka 'ilman nafi'a wa rizqan tayyiba wa 'amalan mutaqabbala",
      "translation": {
        "en": "O Allah, I ask You for beneficial knowledge, pure sustenance, and accepted deeds.",
        "ur": "اے اللہ! میں تجھ سے نفع بخش علم، پاکیزہ رزق اور قبول شدہ عمل مانگتا ہوں",
        "ps": "الله زما خدایه! زه له تا څخه ګټوره علم، پاک رزق او قبول شوي عمل غواړم"
      },
      "reference": "Sunan Ibn Majah 925"
    },
    "category": "Knowledge",
    "usage": "Morning supplication for beneficial knowledge"
  },
  {
    "dua": {
      "arabic": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
      "transliteration": "Allahumma a'inni 'ala dhikrika wa shukrika wa husni 'ibadatika",
      "translation": {
        "en": "O Allah, help me to remember You, to be grateful to You, and to worship You in the best manner.",
        "ur": "اے اللہ! مجھے اپنے ذکر، شکر اور بہترین عبادت کی توفیق عطا فرما",
        "ps": "الله زما خدایه! ما سره د خپل یادولو، شکر او ښه عبادت کې مرسته وکړه"
      },
      "reference": "Sunan Abi Dawud 1522"
    },
    "category": "Worship",
    "usage": "After each prayer for steadfastness in worship"
  }
]